# การปรับแต่งการลูตในเกม SCUM

## แนะนำ

เอกสารนี้อธิบายเกี่ยวกับคุณสมบัติการปรับแต่งการลูตในเกม SCUM การปรับแต่งการลูตทำผ่านการสร้างและการแก้ไขไฟล์ JSON ต่างๆ ความรู้พื้นฐานเกี่ยวกับ JSON เป็นสิ่งจำเป็น หากคุณไม่เคยได้ยินเกี่ยวกับ JSON หรือจำเป็นต้องทบทวนความรู้ นี่คือลิงก์ที่มีประโยชน์:

- [JSON](https://www.json.org/json-en.html)
- [W3Schools JSON Intro](https://www.w3schools.com/js/js_json_intro.asp)
- [JSON.org](https://www.json.org/)

ไฟล์ JSON ที่เกี่ยวข้องกับการลูตส่วนใหญ่สามารถส่งออกจากเกมได้ผ่านคำสั่งแอดมินต่างๆ ขณะที่บางไฟล์ต้องสร้างขึ้นเอง เส้นทางหลักที่พบไฟล์ JSON คือ:

- สำหรับเซิร์ฟเวอร์มัลติเพลเยอร์: `<Server>\SCUM\Saved\Config\WindowsServer\Loot`
- สำหรับโหมดผู้เล่นคนเดียว: `%LocalAppData%\SCUM\Saved\Config\WindowsNoEditor\Loot`

ไฟล์ JSON จะถูกโหลดเมื่อเริ่มเกม และการเปลี่ยนแปลงใดๆ สามารถโหลดใหม่ได้ผ่านคำสั่ง `#ReloadLootCustomizationsAndResetSpawners` เพื่อทดสอบการปรับเปลี่ยนได้อย่างรวดเร็ว คำสั่งนี้จะถูกอธิบายรายละเอียดในภายหลัง รวมถึงกระบวนการส่งออก สร้าง และแก้ไขไฟล์ JSON ที่เกี่ยวข้องกับการลูต

ก่อนที่จะเข้าสู่คำสั่งและการปรับเปลี่ยนการลูต เราจะครอบคลุมแนวคิดและคุณสมบัติพื้นฐานที่จำเป็นสำหรับการปรับแต่งการลูตอย่างมีประสิทธิภาพ

หากคุณต้องการเริ่มต้นทันที ให้ข้ามไปที่ส่วนการส่งออก

## ความหายาก

ความหายากถูกใช้ตลอดการปรับแต่งการลูต โดยมันกำหนดความน่าจะเป็นในการเลือกวัตถุจากชุดของวัตถุ วัตถุเป็นคำที่เป็นนามธรรมและสามารถหมายถึงอะไรก็ได้ คุณสามารถคิดว่าวัตถุเป็นไอเท็มชั่วคราว แต่ละวัตถุในชุดจะได้รับการกำหนดความหายากซึ่งสามารถเป็นค่าดังต่อไปนี้:

- **Abundant**: มีโอกาสถูกเลือก 32 เท่าของ Extremely Rare
- **Common**: มีโอกาสถูกเลือก 16 เท่าของ Extremely Rare
- **Uncommon**: มีโอกาสถูกเลือก 8 เท่าของ Extremely Rare
- **Rare**: มีโอกาสถูกเลือก 4 เท่าของ Extremely Rare
- **Very Rare**: มีโอกาสถูกเลือก 2 เท่าของ Extremely Rare
- **Extremely Rare**: มีโอกาสถูกเลือกเท่ากับวัตถุ Extremely Rare อื่นๆ ในชุด

ตัวอย่างเช่น ชุดของวัตถุดังต่อไปนี้ (วัตถุ
